Autodesk.Revit.DB.Structure.RebarBendingDetail.IsSchematicBendingDetail(Autodesk.Revit.DB.Element)
Validate that the element is a schematic bending detail.
bendingDetail:
The element that will be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.IsRealisticBendingDetail(Autodesk.Revit.DB.Element)
Validate that the element is a realistic bending detail.
bendingDetail:
The element that will be checked.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetTagRelativePosition(Autodesk.Revit.DB.Element)
Gets the embedded tag position w.r.t. the realistic bending detail element in model coordinates.
Remarks:
This function is exclusive to realistic bending detail mode.
bendingDetail:
The bending detail element.
Returns:
The new relative position of the embedded tag w.r.t. the bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This option is only available for realistic bending detail elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.ResetAnnotationPositions(Autodesk.Revit.DB.Element)
Resets the positions of the bending detail annotations to the default position.
bendingDetail:
The bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.ResetTagRelativePosition(Autodesk.Revit.DB.Element)
Resets the embedded tag position w.r.t. the realistic bending detail element to the selected tag position.
Remarks:
This function is exclusive to realistic bending detail mode.
bendingDetail:
The bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This option is only available for realistic bending detail elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.SetTagRelativePosition(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ)
Sets the embedded tag position w.r.t. the realistic bending detail element in model coordinates.
Remarks:
This function is exclusive to realistic bending detail mode.
bendingDetail:
The bending detail element.
relativeOffset:
The new relative position of the embedded tag w.r.t. the bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This option is only available for realistic bending detail elements.
-or-
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetTagRelativeRotation(Autodesk.Revit.DB.Element)
Gets the embedded tag rotation angle w.r.t. the realistic bending detail element.
Remarks:
This function is exclusive to realistic bending detail mode.
bendingDetail:
The bending detail element.
Returns:
The rotation angle of the embedded tag w.r.t. the bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This option is only available for realistic bending detail elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.SetTagRelativeRotation(Autodesk.Revit.DB.Element,System.Double)
Sets the embedded tag rotation angle w.r.t. the realistic bending detail element.
Remarks:
This function is exclusive to realistic bending detail mode.
bendingDetail:
The bending detail element.
rotation:
The new rotation angle of the embedded tag w.r.t. the bending detail element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This option is only available for realistic bending detail elements.
-or-
The given value for rotation is not a number
-or-
The given value for rotation is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetHosts(Autodesk.Revit.DB.Element)
Gets a reference to the reinforcement elements that this bending detail represents.
bendingDetail:
The bending detail for which we want to get the host.
Returns:
Returns a reference pointing to the reinforcement elements represented by the input bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.RemoveHosts(Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Remove the reinforcement elements from those represented by the input bending detail.
bendingDetail:
The bending detail for which we want to set the host.
references:
References pointing to the reinforcement element that will be removed from the input bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
-or-
This option is only available for schematic bending detail elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.AddHosts(Autodesk.Revit.DB.Element,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
Adds the reinforcement elements that will be represented by the input bending detail.
bendingDetail:
The bending detail for which we want to set the host.
references:
Reference pointing to the reinforcement element that will be represented by the input bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
-or-
This option is only available for schematic bending detail elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail.GetHost(Autodesk.Revit.DB.Element)
Gets a reference to the reinforcement element that this bending detail represents.
bendingDetail:
The bending detail for which we want to get the host.
Returns:
Returns a reference pointing to the reinforcement element represented by the input bending detail.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.Structure.RebarBendingDetail
Utility class with methods needed for the bending details in view.
The bending detail element has two modes -- the schematic bending detail and realistic bending detail. Some functions are exclusive to one mode.
Since:
2024